app/controllers/game_controller.rb

INSERT INTO `games` (`created_at`, `name`, `updated_at`) VALUES ('2014-05-02 02:15:39', '50afc200724858d9ff8a', '2014-05-02 02:15:39')
SELECT `games`.* FROM `games` WHERE `games`.`name` = 'asdf' LIMIT 1
INSERT INTO `players` (`created_at`, `game_id`, `moves`, `name`, `updated_at`) VALUES ('2014-05-02 10:22:03', 123, 'Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,', '99b17bee3ae637da6fba', '2014-05-02 10:22:03')
INSERT INTO `player_moves` (`created_at`, `moves`, `player_id`, `updated_at`) VALUES ('2014-05-02 03:32:25', 'R,P,S,L,S,P,S,R,L,Sp,', 10, '2014-05-02 03:32:25')
---
  def create
    #specify whether user is waiting for adversary?
    is_waiting = true
    if params[:adversary_game].blank?
      obj_params = params.require(:game).permit(:name)
      @game = Game.new(obj_params)
      @game.save
    else
      @game = Game.find_by_name(params[:adversary_game])
      is_waiting = false
    end
    if !@game.nil?
      @player = Player.create(:name => SecureRandom.hex(10), :game_id => @game.id)
      @moves = PlayerMove.create(:moves => params[:player_moves], :player_id => @player.id)

SELECT `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`game_id` = 11 AND (`players`.`player_id` != '11') ORDER BY `players`.`id` ASC LIMIT 1
INSERT INTO `players` (`created_at`, `game_id`, `name`, `updated_at`) VALUES ('2014-05-02 02:37:35', 4, '1b6294fd5581fdc01435', '2014-05-02 02:37:35')
---
  def show
    @game = Game.find(params[:id])
    @current_player = Player.find(params[:player_id])

    @current_player_moves_arr = @current_player.player_move.moves.split(",")
    @adversary = @game.players.where.not(:id => params[:player_id]).first

    @adversary_moves = nil
    if @adversary
      @adversary_moves_arr = @adversary.player_move.moves.split(",")
      @result = []
      @current_player_moves_arr.each_with_index do |move, index|
        @result << GAME_RULE["#{move}#{@adversary_moves_arr[index]}"]